programming/understanding-monads.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding Monads</title>
<meta property="og:title" content="Understanding Monads" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">Understanding Monads</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#pure-functions">2. Pure functions</a></li>
<li><a href="#from-impure-to-monadic">3. From impure to monadic</a>
<ul>
<li><a href="#a-simple-writer">3.1. A simple writer</a></li>
<li><a href="#making-the-writer-pure">3.2. Making the writer pure</a></li>
<li><a href="#extracting-the-binding-logic">3.3. Extracting the binding logic</a></li>
<li><a href="#making-the-writer-a-monad">3.4. Making the writer a monad</a></li>
<li><a href="#final-code">3.5. Final code</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
This article is about <a href="https://en.wikipedia.org/wiki/Monad_(functional_programming)">monads</a> in the context of programming, specifically about a
design pattern that is often used in purely functional languages, such as
<a href="https://www.haskell.org/">Haskell</a>. This concept originates from <a href="https://en.wikipedia.org/wiki/Category_theory">category theory</a>, but this article won&rsquo;t be
focusing on that.
</p>

<p>
Although I haven&rsquo;t personally used Haskell a lot, I have known about monads for
a long time, probably since I heard about the <a href="https://en.wikipedia.org/wiki/Xmonad">xmonad</a> window manager. After
researching on this topic for a few days, I decided to write a small article
about what I learned, since it might be useful for some people. This article
won&rsquo;t focus specifically on Haskell, so most concepts can be applied to many
languages, and not a lot of programming background is required from the reader.
</p>

<p>
Lastly, I would like to mention that this article won&rsquo;t be focusing specifically
on Haskell; if you are interested in that, I recommend you check out the
articles on <a href="https://mmhaskell.com/monads">this link</a>.
</p>
</div>
</div>

<div id="outline-container-pure-functions" class="outline-2">
<h2 id="pure-functions"><span class="section-number-2">2.</span> Pure functions</h2>
<div class="outline-text-2" id="text-pure-functions">
<p>
Before trying to understand monads and their use cases, it&rsquo;s important to know
about <a href="https://en.wikipedia.org/wiki/Pure_function">pure functions</a>, and why they are desirable. Pure functions are a kind of
function that satisfy 2 properties:
</p>

<ol class="org-ol">
<li>The value returned by the function depends only on its inputs, so identical
values are returned across multiple calls with identical inputs.</li>
<li>The function must not have <a href="https://en.wikipedia.org/wiki/Side_effect_(computer_science)">side effects</a>, such as modifying global variables,
input/output streams, etc.</li>
</ol>

<p>
For example, the following python functions are pure<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, since they don&rsquo;t break any of
the rules above.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">double_sum</span>(a, b):
    <span style="color: #ff6f9f;">return</span> (a + b) * <span style="color: #88ca9f;">2</span>

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">count_uppercase</span>(string):
    <span style="color: #6ae4b9;">result</span> = <span style="color: #88ca9f;">0</span>
    <span style="color: #ff6f9f;">for</span> character <span style="color: #ff6f9f;">in</span> string:
        <span style="color: #ff6f9f;">if</span> character.isupper():
            <span style="color: #6ae4b9;">result</span> += <span style="color: #88ca9f;">1</span>
    <span style="color: #ff6f9f;">return</span> result;
</pre>
</div>

<p>
However, the following are not pure, because they are either influenced by the
external program state, or because they alter it.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6ae4b9;">my_global</span> = <span style="color: #88ca9f;">0</span>

<span style="color: #989898;"># </span><span style="color: #989898;">Accesses external state.</span>
<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">global_sum</span>(n):
    <span style="color: #ff6f9f;">return</span> my_global + n

<span style="color: #989898;"># </span><span style="color: #989898;">Modifies external state (global variable).</span>
<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">impure_sum</span>(a, b):
    <span style="color: #6ae4b9;">my_global</span> = <span style="color: #88ca9f;">123</span>
    <span style="color: #ff6f9f;">return</span> a + b

<span style="color: #989898;"># </span><span style="color: #989898;">Modifies external state (I/O stream).</span>
<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">print_sum</span>(a, b):
    <span style="color: #6ae4b9;">result</span> = a + b
    <span style="color: #feacd0;">print</span>(f<span style="color: #00d3d0;">"Result: </span>{result}<span style="color: #00d3d0;">"</span>)
    <span style="color: #ff6f9f;">return</span> result
</pre>
</div>

<p>
Pure functions offer many advantages over impure functions, for both the machine
(compiler, interpreter) and the human (designing the architecture, programming,
testing, documenting). Some of these advantages include:
</p>

<ul class="org-ul">
<li><b>Result caching</b> (<a href="https://en.wikipedia.org/wiki/Memoization">Memoization</a>): If a pure function is repeatedly called with
the same arguments, since it&rsquo;s guaranteed to return the same result given the
same inputs, it could be stored in a look-up table, for better performance
when called multiple times.</li>
<li><b>Better optimizations</b>: If the compiler/interpreter knows that a function is
pure, it can safely do many more optimizations, including result caching, or
skipping calls altogether<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.</li>
<li><b>Predictability and security</b>: From the programmer&rsquo;s point of view, it&rsquo;s much
easier to test a pure function than an impure one, since it doesn&rsquo;t depend on
an external environment that might make the tests more unreliable or complex.</li>
</ul>
</div>
</div>

<div id="outline-container-from-impure-to-monadic" class="outline-2">
<h2 id="from-impure-to-monadic"><span class="section-number-2">3.</span> From impure to monadic</h2>
<div class="outline-text-2" id="text-from-impure-to-monadic">
<p>
Before diving into what monads are, it&rsquo;s important to understand the problem
that they attempt to solve. Monads are useful when a series of steps or
computations (e.g. function calls) need to be combined, and when these
computations somehow extend an input type, adding some kind of context. For
example, the programmer might want to combine or link a series of functions
whose arguments are integers, but whose returned data type is a more complex
structure that extends the received integer type.
</p>
</div>
