programming/understanding-monads.html

<div id="outline-container-a-simple-writer" class="outline-3">
<h3 id="a-simple-writer"><span class="section-number-3">3.1.</span> A simple writer</h3>
<div class="outline-text-3" id="text-a-simple-writer">
<p>
To illustrate this problem, along with a possible solution, the <i>writer</i> monad
will be used, which allows functions to extend a base type with a series of logs
that will be appended together into a list. Below is some Python code that
implements this <i>writer</i> functionality without using a monad. Each function
performs some computation (in this case, simple arithmetic operations), while
also logging a string into a global list variable.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6ae4b9;">global_log_list</span> = []

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">add</span>(a, b):
    global_log_list.append(f<span style="color: #00d3d0;">"Added </span>{a}<span style="color: #00d3d0;"> to </span>{b}<span style="color: #00d3d0;">"</span>)
    <span style="color: #ff6f9f;">return</span> a + b

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">sub</span>(a, b):
    global_log_list.append(f<span style="color: #00d3d0;">"Subtracted </span>{a}<span style="color: #00d3d0;"> from </span>{b}<span style="color: #00d3d0;">"</span>)
    <span style="color: #ff6f9f;">return</span> a - b

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">mul</span>(a, b):
    global_log_list.append(f<span style="color: #00d3d0;">"Multiplied </span>{a}<span style="color: #00d3d0;"> to </span>{b}<span style="color: #00d3d0;">"</span>)
    <span style="color: #ff6f9f;">return</span> a * b

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">div</span>(a, b):
    global_log_list.append(f<span style="color: #00d3d0;">"Divided </span>{a}<span style="color: #00d3d0;"> by </span>{b}<span style="color: #00d3d0;">"</span>)
    <span style="color: #ff6f9f;">return</span> a / b
</pre>
</div>

<p>
To combine calls to these functions with the current design, one may store the
result of each call in a variable, pass it to the next function as an argument,
and overwrite the stored result with the new returned value. After the chain of
computations is done, the final result is stored, along with the list of logs
that were generated by the functions.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6ae4b9;">result</span> = add(<span style="color: #88ca9f;">6</span>, <span style="color: #88ca9f;">5</span>)
<span style="color: #6ae4b9;">result</span> = sub(result, <span style="color: #88ca9f;">4</span>)
<span style="color: #6ae4b9;">result</span> = mul(result, <span style="color: #88ca9f;">3</span>)
<span style="color: #6ae4b9;">result</span> = div(result, <span style="color: #88ca9f;">2</span>)

<span style="color: #feacd0;">print</span>(f<span style="color: #00d3d0;">"Final result: </span>{result}<span style="color: #00d3d0;">"</span>)
<span style="color: #feacd0;">print</span>(<span style="color: #00d3d0;">"Logs:"</span>)
<span style="color: #ff6f9f;">for</span> line <span style="color: #ff6f9f;">in</span> global_log_list:
    <span style="color: #feacd0;">print</span>(f<span style="color: #00d3d0;">"  * </span>{line}<span style="color: #00d3d0;">"</span>)
</pre>
</div>

<p>
The previous code would print the following output:
</p>

<pre class="example" id="example1">
Final result: 10.5
Logs:
  * Added 6 to 5
  * Subtracted 11 from 4
  * Multiplied 7 to 3
  * Divided 21 by 2
</pre>

<p>
Notice how the internal structure of those functions is very similar, and since
much behavior is shared, they could be further abstracted. Also note how the
functions are not pure because they produce side effects by modifying a
global variable.
</p>
</div>
</div>

<div id="outline-container-making-the-writer-pure" class="outline-3">
<h3 id="making-the-writer-pure"><span class="section-number-3">3.2.</span> Making the writer pure</h3>
<div class="outline-text-3" id="text-making-the-writer-pure">
<p>
Instead of modifying a global list, these functions could return their log line
as part of the result, making them pure. In order to chain multiple functions,
combining their logs, they could also receive the previous log list as part of
their arguments.
</p>

<p>
First, a new data type should be defined, which extends the integer type by
adding the log list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff6f9f;">class</span> <span style="color: #79a8ff;">LoggedInt</span>:
    <span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">__init__</span>(<span style="color: #ff6f9f;">self</span>, val, logs):
        <span style="color: #ff6f9f;">self</span>.<span style="color: #6ae4b9;">val</span> = val
        <span style="color: #ff6f9f;">self</span>.<span style="color: #6ae4b9;">logs</span> = logs

<span style="color: #989898;"># </span><span style="color: #989898;">Example</span>
<span style="color: #6ae4b9;">logged_int</span> = LoggedInt(<span style="color: #88ca9f;">5</span>, [<span style="color: #00d3d0;">"Some log line"</span>, <span style="color: #00d3d0;">"Another log line"</span>])
</pre>
</div>

<p>
The arithmetic functions can be modified to receive and return this new data
type, appending the new log line to the previous log list. Note how the first
argument of the following functions is a <code>LoggedInt</code>, but the second argument is
still a simple integer.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">add</span>(logged_a, b):
    <span style="color: #ff6f9f;">return</span> LoggedInt(
        logged_a.val + b,  <span style="color: #989898;"># </span><span style="color: #989898;">New value</span>
        logged_a.logs + [f<span style="color: #00d3d0;">"Added </span>{logged_a.val}<span style="color: #00d3d0;"> to </span>{b}<span style="color: #00d3d0;">"</span>]  <span style="color: #989898;"># </span><span style="color: #989898;">Extended log list</span>
    )

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">sub</span>(logged_a, b):
    <span style="color: #ff6f9f;">return</span> LoggedInt(
        logged_a.val - b,
        logged_a.logs + [f<span style="color: #00d3d0;">"Subtracted </span>{logged_a.val}<span style="color: #00d3d0;"> from </span>{b}<span style="color: #00d3d0;">"</span>]
    )

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">mul</span>(logged_a, b):
    <span style="color: #ff6f9f;">return</span> LoggedInt(
        logged_a.val * b,
        logged_a.logs + [f<span style="color: #00d3d0;">"Multiplied </span>{logged_a.val}<span style="color: #00d3d0;"> to </span>{b}<span style="color: #00d3d0;">"</span>]
    )

<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">div</span>(logged_a, b):
    <span style="color: #ff6f9f;">return</span> LoggedInt(
        logged_a.val / b,
        logged_a.logs + [f<span style="color: #00d3d0;">"Divided </span>{logged_a.val}<span style="color: #00d3d0;"> by </span>{b}<span style="color: #00d3d0;">"</span>]
    )
</pre>
</div>

<p>
The usage of these functions is similar to the previous ones, but since they now
receive a <code>LoggedInt</code> as their first argument, the first input integer needs to be
<i>promoted</i> to a <code>LoggedInt</code>, initially with an empty log list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6ae4b9;">logged_result</span> = LoggedInt(<span style="color: #88ca9f;">6</span>, [])
<span style="color: #6ae4b9;">logged_result</span> = add(logged_result, <span style="color: #88ca9f;">5</span>)
<span style="color: #6ae4b9;">logged_result</span> = sub(logged_result, <span style="color: #88ca9f;">4</span>)
<span style="color: #6ae4b9;">logged_result</span> = mul(logged_result, <span style="color: #88ca9f;">3</span>)
<span style="color: #6ae4b9;">logged_result</span> = div(logged_result, <span style="color: #88ca9f;">2</span>)

<span style="color: #feacd0;">print</span>(f<span style="color: #00d3d0;">"Final result: </span>{logged_result.val}<span style="color: #00d3d0;">"</span>)
<span style="color: #feacd0;">print</span>(<span style="color: #00d3d0;">"Logs:"</span>)
<span style="color: #ff6f9f;">for</span> line <span style="color: #ff6f9f;">in</span> logged_result.logs:
    <span style="color: #feacd0;">print</span>(f<span style="color: #00d3d0;">"  * </span>{line}<span style="color: #00d3d0;">"</span>)
</pre>
</div>

<p>
With this simple change, the functions are now pure. At this point, however,
this design pattern isn&rsquo;t exactly a monad, and some of the shared logic can be
extracted into separate functions.
</p>
</div>
</div>
