programming/understanding-monads.html

<div id="outline-container-making-the-writer-a-monad" class="outline-3">
<h3 id="making-the-writer-a-monad"><span class="section-number-3">3.4.</span> Making the writer a monad</h3>
<div class="outline-text-3" id="text-making-the-writer-a-monad">
<p>
In order to turn the writer code into a monad, there is one last change that
needs to be made. The current <code>bind</code> function receives 3 arguments, the last one
being a simple integer because it&rsquo;s what the arithmetic functions expect. The
<code>bind</code> function of a proper monad should only receive 2 arguments: a value, whose
type is <i>monadic</i> (e.g. <code>LoggedInt</code>), and a transformation function, which receives
a simple value (e.g. an integer) and returns a new monadic value.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">bind</span>(old_logged_int, function): <span style="color: #989898;"># </span><span style="color: #989898;">Receives two arguments</span>
    <span style="color: #6ae4b9;">unwrapped_val</span> = old_logged_int.val
    <span style="color: #6ae4b9;">new_logged_int</span> = function(unwrapped_val)  <span style="color: #989898;"># </span><span style="color: #989898;">Called with one argument</span>
    <span style="color: #ff6f9f;">return</span> LoggedInt(
        new_logged_int.val,
        old_logged_int.logs + new_logged_int.logs
    )
</pre>
</div>

<p>
After this change, how could the new <code>bind</code> function receive the arithmetic
functions, if they receive two arguments, <code>a</code> and <code>b</code>? This problem has an easy
solution, although it&rsquo;s not particularly pretty depending on the programming
language. All functions can be converted into one-argument functions by
returning a lambda. For example, the following two function calls are
equivalent.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #989898;"># </span><span style="color: #989898;">Define a function that receives integers 'a', 'b' and 'c', and returns an</span>
<span style="color: #989898;"># </span><span style="color: #989898;">integer with the result.</span>
<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">foo</span>(a, b, c):
    <span style="color: #ff6f9f;">return</span> a + b * c

<span style="color: #989898;"># </span><span style="color: #989898;">Define a function that receives an integer 'a', and returns an anonymous</span>
<span style="color: #989898;"># </span><span style="color: #989898;">function that receives an integer 'b', and returns and anonymous function that</span>
<span style="color: #989898;"># </span><span style="color: #989898;">receives an integer 'c' and returns an integer with the result.</span>
<span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">bar</span>(a):
    <span style="color: #ff6f9f;">return</span> <span style="color: #ff6f9f;">lambda</span> b: <span style="color: #ff6f9f;">lambda</span> c: a + b * c

<span style="color: #989898;"># </span><span style="color: #989898;">Example calls.</span>
foo(<span style="color: #88ca9f;">5</span>, <span style="color: #88ca9f;">6</span>, <span style="color: #88ca9f;">7</span>)
bar(<span style="color: #88ca9f;">5</span>)(<span style="color: #88ca9f;">6</span>)(<span style="color: #88ca9f;">7</span>)
</pre>
</div>

<p>
Therefore, the arithmetic functions themselves don&rsquo;t need to be modified, since
the following expressions would be equivalent:
</p>

<div class="org-src-container">
<pre class="src src-python">add(<span style="color: #88ca9f;">5</span>, <span style="color: #88ca9f;">6</span>)

<span style="color: #989898;"># </span><span style="color: #989898;">Equivalent one argument function.</span>
<span style="color: #6ae4b9;">add_six</span> = <span style="color: #ff6f9f;">lambda</span> a: add(a, <span style="color: #88ca9f;">6</span>)
add_six(<span style="color: #88ca9f;">5</span>)
</pre>
</div>

<p>
This is how the bind functions would be called to match the previous example.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6ae4b9;">logged_result</span> = add(<span style="color: #88ca9f;">6</span>, <span style="color: #88ca9f;">5</span>)
<span style="color: #6ae4b9;">logged_result</span> = bind(logged_result, <span style="color: #ff6f9f;">lambda</span> a: sub(a, <span style="color: #88ca9f;">4</span>))
<span style="color: #6ae4b9;">logged_result</span> = bind(logged_result, <span style="color: #ff6f9f;">lambda</span> a: mul(a, <span style="color: #88ca9f;">3</span>))
<span style="color: #6ae4b9;">logged_result</span> = bind(logged_result, <span style="color: #ff6f9f;">lambda</span> a: div(a, <span style="color: #88ca9f;">2</span>))
</pre>
</div>

<p>
Furthermore, using an object-oriented approach, the <code>bind</code> function can be
converted to a method of <code>LoggedInt</code>, allowing the caller to bind functions with a
cleaner notation, since it now accesses the instance of the object.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff6f9f;">class</span> <span style="color: #79a8ff;">LoggedInt</span>:
    <span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">__init__</span>(<span style="color: #ff6f9f;">self</span>, val, logs):  <span style="color: #989898;"># </span><span style="color: #989898;">Unchanged</span>
        <span style="color: #ff6f9f;">self</span>.<span style="color: #6ae4b9;">val</span> = val
        <span style="color: #ff6f9f;">self</span>.<span style="color: #6ae4b9;">logs</span> = logs

    <span style="color: #ff6f9f;">def</span> <span style="color: #4ae2ff;">bind</span>(<span style="color: #ff6f9f;">self</span>, function):
        <span style="color: #6ae4b9;">new_logged_int</span> = function(<span style="color: #ff6f9f;">self</span>.val)
        <span style="color: #ff6f9f;">return</span> LoggedInt(
            new_logged_int.val,
            <span style="color: #ff6f9f;">self</span>.logs + new_logged_int.logs
        )

<span style="color: #989898;"># </span><span style="color: #989898;">Example usage.</span>
<span style="color: #6ae4b9;">logged_result</span> = (
    add(<span style="color: #88ca9f;">6</span>, <span style="color: #88ca9f;">5</span>).bind(<span style="color: #ff6f9f;">lambda</span> a: sub(a, <span style="color: #88ca9f;">4</span>))
             .bind(<span style="color: #ff6f9f;">lambda</span> a: mul(a, <span style="color: #88ca9f;">3</span>))
             .bind(<span style="color: #ff6f9f;">lambda</span> a: div(a, <span style="color: #88ca9f;">2</span>))
)
</pre>
</div>
</div>
</div>
