programming/understanding-monads.org
** Final code
:PROPERTIES:
:CUSTOM_ID: final-code
:END:

This is the final python code for the /writer/ monad.

#+begin_src python :results output
# Monadic type, expands a base integer type to add logging functionality.
class LoggedInt:
    def __init__(self, val, logs):
        self.val = val
        self.logs = logs

    # Applies a one-argument transformation function to the current instance,
    # and combines the result with the existing log list.
    def bind(self, function):
        new_logged_int = function(self.val)
        return LoggedInt(
            new_logged_int.val,
            self.logs + new_logged_int.logs
        )

# Transformation functions.
def add(a, b):
    return LoggedInt(a + b, [f"Added {a} to {b}"])
def sub(a, b):
    return LoggedInt(a - b, [f"Subtracted {a} from {b}"])
def mul(a, b):
    return LoggedInt(a * b, [f"Multiplied {a} to {b}"])
def div(a, b):
    return LoggedInt(a / b, [f"Divided {a} by {b}"])

# Example usage.
logged_result = (
    add(6, 5).bind(lambda a: sub(a, 4))
             .bind(lambda a: mul(a, 3))
             .bind(lambda a: div(a, 2))
)

print(f"Final result: {logged_result.val}")
print("Logs:")
for line in logged_result.logs:
    print(f"  * {line}")
#+end_src

#+RESULTS:
: Final result: 10.5
: Logs:
:   * Added 6 to 5
:   * Subtracted 11 from 4
:   * Multiplied 7 to 3
:   * Divided 21 by 2
